import axios from "axios";
import { AuthResponse } from "../types/types";

// создаем наш api(axios),но с определенными настройками
const $api = axios.create({

    withCredentials: true, // указываем,чтобы к каждому запросу axios cookie цеплялись автоматически,указываем это поле true

    baseURL: `${process.env.REACT_APP_BACKEND_URL}/api`  // указываем базовый url для axios(в данном случае нашу переменную url до бэкэнда REACT_APP_BACKEND_URL в .env файле,это основной url до бэкэнда) и /api,то есть уже конкретный url до нашего роутера на бэкэнде

})

// создаем interceptor(функция,которая будет отрабатывать на каждый запрос или ответ от сервера(в данном случае на каждый запрос),эта функция параметром принимает config инстанса axios(типа axios),у этого config есть те же поля типа headers,baseUrl и тд) на request(запрос на сервер)
$api.interceptors.request.use((config) => {

    config.headers.Authorization = `Bearer ${localStorage.getItem('token')}`; // указываем значение полю Authorization у поля headers у config,даем ему значение токена,первым словом указываем тип токена Bearer(в данном случае) и сам токен,который берем из localStorage по ключу(по названию) token

    return config; // возвращаем этот config

})

// создаем interceptor(функция,которая будет отрабатывать на каждый запрос на сервер(в данном случае на каждый ответ от сервера),эта функция параметром принимает config инстанса axios(типа axios),у этого config есть те же поля типа headers,baseUrl и тд) на response(ответ от сервера),первым параметром указываем callback,который выполнится,если запрос прошел успешно,а вторым параметром указываем callback,который выполнится в тот момент,когда прозошла ошибка
$api.interceptors.response.use((config) => {

    return config; // возвращаем этот config

}, async (error) => {

    const originalRequest = error.config; // указываем этот originalRequest и проверки ниже на error.config._isRetry,чтобы не зациклились запросы, берем config(типа запрос инстанса axios(типа axios)) у error(параметр этой функции callback) и помещаем его в переменную originalRequest

    // если status код у response у error равен 401(то есть пришла ошибка от сервера,что пользователь не авторизован), и если error.config true(то есть error.config есть),и если error.config._isRetry false(то есть повторный запрос мы еще не делали,это мы проверяем,чтобы эти запросы не зациклились и чтобы повторный запрос можно было сделать только 1 раз)
    if (error.response.status === 401 && error.config && !error.config._isRetry) {

        originalRequest._isRetry = true; // указываем,что это уже повторный запрос,соответственно после этого запроса,других таких же уже не будет

        // оборачиваем здесь в try catch для отлавливания ошибок
        try {

            // здесь используем уже обычный axios,так как и так может вернуться статус код 401 и мы уже знаем,что пользователь не авторизован,и уже наш инстанс axios не нужен здесь,указываем тип в generic,что в ответе от сервера ожидаем наш тип данных AuthResponse, указываем url до эндпоинта /refresh на бэкэнде(в данном случае вынесли нашу переменную основного url до бэкэнда REACT_APP_BACKEND_URL в .env файле,это основной url до бэкэнда) и /api,то есть уже конкретный url до нашего роутера на бэкэнде на бэкэнде и через / указываем refresh(это тот url,где мы выдаем access и refresh токены на бэкэнде),и вторым параметром указываем объект опций,указываем поле withCredentials true(чтобы автоматически с запросом отправлялись cookies)
            const response = await axios.get<AuthResponse>(`${process.env.REACT_APP_BACKEND_URL}/api/refresh`, { withCredentials: true }); // в переменную response здесь будут помещены 2 токена(access и refresh) и поле user с типом данных на основе нашего интерфейса IUser,если запрос прошел успешно

            localStorage.setItem('token', response.data.accessToken); // сохраняем по новой access токен в localStorage по ключу token

            return $api.request(originalRequest); // возвращаем,используем функцию request у нашего инстанса axios и передаем туда в параметре переменную originalRequest(она хранит в себе все данные для запроса(первичного запроса,после которого пришла ошибка)),то есть делаем запрос еще раз после того,как сделали запрос на получение токенов(например,сделали запрос на получение пользователей,после этого,когда пришел 401 статус код(то есть пользователь не авторизован,refresh токен или access токен слетел),делаем запрос на получение refresh и access токенов и после этого делаем опять запрос на получение пользователей(в таком случае,если не было ошибок при получении refresh и access токенов,то уже при повторном запросе на получение пользователей ошибки и 401 статус кода не будет,так как тогда уже сохраним refresh токен в cookie(на бэкэнде) и access токен в localStorage))

        } catch (e) {

            console.log('UNAUTHORIZED'); // выводим сообщение,если будет ошибка

        }

    }

    throw error; // если условие выше не отработало,то бросаем ошибку на верхний уровень(то есть обрабатываем ее в функции по дефолту,которая есть у axios для обработки ошибок или типа такого, то есть показываем ошибку,если она не была со статус кодом 401),так как может быть ошибка не только 401 статус код

})

export default $api; // экспортируем наш $api(инстанс axios)